{
  "msg": "success",
  "data": [
    {
      "position_title": "Software Developers(React & Node Js)",
      "department": 3,
      "job_type": 1,
      "min_exp": "3",
      "max_exp": 12,
      "open_positions": 4,
      "roles_responsibilities": "<p dir=\"ltr\"><strong><span style=\"color: #e67e23;\">JOB DESCRIPTION: SENIOR SOFTWARE ENGINEER&nbsp;</span></strong></p>\n<p dir=\"ltr\">Job Overview:<br>Whizlabs is looking for motivated and skilled Software Engineers with strong programming knowledge in React.js, Node.js, Express.js, and related technologies. If you are passionate about building scalable, high-quality applications and thrive in a collaborative environment, this role offers an excellent opportunity to advance your skills and make a meaningful impact.</p>\n<p dir=\"ltr\">Responsibilities:</p>\n<ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Develop and maintain web applications using React.js, Node.js, Express.js, and related technologies.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Collaborate with cross-functional teams, including designers, product managers, and other developers, to deliver high-quality solutions.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Write clean, efficient, and well-documented code, following best practices in software development.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Troubleshoot, debug, and optimize applications to ensure high performance and responsiveness.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Contribute to architectural decisions, code reviews, and process improvements to drive project success.</p>\n</li>\n</ul>\n<p>&nbsp;</p>\n<p dir=\"ltr\">Benefits:</p>\n<ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Opportunity to work with experienced professionals in the cloud computing industry.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Hands-on experience with cutting-edge technologies.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Competitive compensation and benefits.</p>\n</li>\n</ul>\n<p dir=\"ltr\">This role provides an excellent opportunity to expand your expertise in software development, deepen your skills with modern technologies like React.js and Node.js, and advance your career through hands-on experience in building scalable applications</p>\n<p dir=\"ltr\">&nbsp;</p>\n<p>&nbsp;</p>",
      "minimum_qualifications": "<p dir=\"ltr\">Requirements:</p>\n<ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Experience: 2-5 years of hands-on experience with React.js, Node.js, Express.js, and related JavaScript frameworks.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Strong understanding of JavaScript, HTML, CSS, and RESTful API design.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Familiarity with version control systems (e.g., Git) and agile development methodologies.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Knowledge of database systems (SQL or NoSQL) is a plus.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Excellent problem-solving skills and a proactive approach to learning and adapting new technologies.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Strong communication skills and ability to work effectively in a team environment.</p>\n</li>\n</ul>\n<p dir=\"ltr\">Nice-to-Have Skills:</p>\n<ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Experience with cloud services (e.g., AWS, Azure, Google Cloud) is a plus.</p>\n</li>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\">Familiarity with modern CI/CD pipelines and deployment practices.</p>\n</li>\n</ul>\n<p>&nbsp;</p>",
      "status": 1,
      "created_by": 496,
      "created_at": "2024-12-13T04:14:47.000Z",
      "updated_at": null,
      "id": 298,
      "slug": "applicationforsoftwaredeveloperrole",
      "about_whizlabs": "<p dir=\"ltr\">About Whizlabs:</p>\n<p dir=\"ltr\">Whizlabs is a trusted leader in professional training, known for its commitment to excellence and innovation in e-learning. Our mission is to empower professionals with high-quality, affordable training that accelerates career growth and personal development. By making learning accessible and impactful, we help individuals advance their skills, achieve their professional goals, and uplift their lives. Join us in our journey to inspire success and drive meaningful change.</p>",
      "order_by": 16,
      "expired_at": null
    },
    {
      "position_title": "Sales Development Lead",
      "department": 7,
      "job_type": 1,
      "min_exp": "5",
      "max_exp": 10,
      "open_positions": 1,
      "roles_responsibilities": "<ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\"><strong>Outbound Outreach:</strong></p>\n</li>\n<ul>\n<li>Identify and research potential B2B customers in the US and Europe who align with the ideal customer profile.</li>\n<li>Utilize tools like LinkedIn Sales Navigator, Apollo, and other data sources to gather contact information.</li>\n<li>Execute multi-channel outreach campaigns, including cold calling, cold emailing, and social selling (e.g., LinkedIn).</li>\n<li>Craft outreach messages that resonate with the target audience and industry.</li>\n<li>Engage prospects through strategic, value-driven communication to generate interest.</li>\n</ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\"><strong>Appointment Setting and Lead Nurturing:</strong></p>\n</li>\n<ul>\n<li>Schedule meetings, demos, or discovery calls with qualified leads for the sales team.</li>\n<li>Coordinate with the sales team to ensure a smooth handover of qualified leads.</li>\n<li>Follow up with prospects to confirm meetings and provide necessary information.</li>\n<li dir=\"ltr\" role=\"presentation\">Engage with leads who are not yet ready to buy through regular follow-ups and sharing of relevant content.</li>\n</ul>\n</ul>\n<ul>\n<li dir=\"ltr\" aria-level=\"1\">\n<p dir=\"ltr\" role=\"presentation\"><strong>Market Research &amp; Intelligence:</strong></p>\n<ul>\n<li>Conduct thorough market research to identify key industries, potential clients, and emerging trends, ensuring tailored outreach that resonates with target audiences.</li>\n</ul>\n<p>&nbsp;</p>\n</li>\n</ul>",
      "minimum_qualifications": "<ul>\n<li>Bachelor&rsquo;s or Master&rsquo;s degree in business, marketing, or a related field.</li>\n<li>Familiarity with tools like LinkedIn Sales Navigator, Apollo, and CRM software.</li>\n<li>Excellent communication and interpersonal skills.</li>\n<li>Ability to work independently and build a team from scratch.</li>\n<li>Strong analytical and problem-solving abilities.</li>\n<li>Proven success in US and/or European markets..</li>\n</ul>",
      "status": 1,
      "created_by": 4,
      "created_at": "2024-09-25T03:48:37.000Z",
      "updated_at": "2024-09-25T06:00:02.000Z",
      "id": 265,
      "slug": "sd-lead",
      "about_whizlabs": "<p>Founded in 2000 by serial entrepreneurs who hailed from IIT Delhi. We are India&rsquo;s one of the leading certification training providers, also awarded the ' Most Innovative Indian IT Company&rsquo; award by NASSCOM in 2004 . We are one of the first in the industry to launch online training for various technologies.</p>\n<p>Based in Bangalore, Coimbatore and New Delhi (India), we have helped over 5 Million professionals and companies across 150+ countries to get trained, pass certifications, and helped them to succeed in their careers.</p>",
      "order_by": 12,
      "expired_at": null
    },
    {
      "position_title": "Technical Lead",
      "department": 3,
      "job_type": 1,
      "min_exp": "5",
      "max_exp": 10,
      "open_positions": 2,
      "roles_responsibilities": "<p><strong>Technical Leadership</strong></p>\n<ul>\n<li>Lead and mentor a team of developers,providing guidance on coding standards, best practices and problem solving.</li>\n<li>Define technical architecture and design patterns for new projects and enhancements.</li>\n<li>Collaborate with product managers, designers, and other stakeholders to translate business requirements into technical specifications.</li>\n</ul>\n<p><strong>Development</strong></p>\n<ul>\n<li>Write clean, maintainable, and efficient code using Node.js and React.js.</li>\n<li>Design and develop RESTful APIs and microservices architecture.</li>\n<li>Ensure the responsiveness of applications, optimizing for maximum speed and scalability.</li>\n<li>Conduct code reviews and provide constructive feedback to team members.</li>\n</ul>\n<p><span class=\"ui-provider a b c d e f g h i j k l m n o p q r s t u v w x y z ab ac ae af ag ah ai aj ak\" dir=\"ltr\"><strong>Project Management</strong></span></p>\n<ul>\n<li>Participate in the full software development lifecycle, including planning, development, testing, deployment, and maintenance.</li>\n<li>Coordinate with cross-functional teams to deliver high-quality products on time.</li>\n<li>Monitor and manage technical debt, ensuring long-term codebase maintainability.</li>\n</ul>\n<p><strong>Innovation and Continuous Improvement</strong></p>\n<ul>\n<li>Stay updated with the latest trends and technologies in web development and introduce them to the team.</li>\n<li>Drive continuous improvement by identifying and implementing new tools, processes, and methodologies.</li>\n<li>Foster a culture of innovation, collaboration, and continuous learning within the team.</li>\n</ul>",
      "minimum_qualifications": "<ul>\n<li>Bachelor&rsquo;s or Master&rsquo;s degree in Computer Science, Engineering, or a related field.</li>\n<li>6+ years of hands-on experience in full-stack development, with a strong focus on Node.js and React.js.</li>\n<li>Proven experience in leading and mentoring development teams.</li>\n<li>Proficiency in front-end technologies like HTML5, CSS3, and JavaScript (ES6+).</li>\n<li>Experience with databases like MongoDB, MySQL, or PostgreSQL.</li>\n<li>Strong understanding of RESTful API design and microservices architecture.</li>\n<li>Familiarity with cloud platforms (AWS, Azure, etc.) and CI/CD pipelines.</li>\n<li>Excellent problem-solving skills and attention to detail.</li>\n<li>Strong communication and collaboration skills, with the ability to work effectively across different teams and departments.</li>\n</ul>",
      "status": 1,
      "created_by": 826,
      "created_at": "2024-09-30T17:58:49.000Z",
      "updated_at": null,
      "id": 266,
      "slug": "techlead",
      "about_whizlabs": "<p dir=\"ltr\">Whizlabs is a leading online training platform that offers certification courses and practice tests for IT professionals. We're committed to providing high-quality education and helping individuals achieve their career goals.</p>",
      "order_by": 13,
      "expired_at": null
    },
    {
      "position_title": "SEO Analyst",
      "department": 11,
      "job_type": 1,
      "min_exp": "4",
      "max_exp": 6,
      "open_positions": 1,
      "roles_responsibilities": "<ul>\n<li>Develop and implement effective SEO strategies for global clients.</li>\n<li>Conduct keyword research and optimize content to improve rankings and drive organic traffic.</li>\n<li>Monitor and analyze SEO performance using tools like Google Analytics, SEMrush, and Ahrefs.</li>\n<li>Perform regular audits to identify and resolve issues affecting search engine performance.</li>\n<li>Collaborate with the content team to ensure SEO best practices are integrated into content creation.</li>\n<li>Stay updated with the latest SEO trends, algorithm changes, and industry best practices.</li>\n<li>Provide actionable insights and recommendations to improve SEO performance and achieve business goals.</li>\n<li>Prepare and present regular reports on SEO metrics and progress to stakeholders.</li>\n</ul>",
      "minimum_qualifications": "<ul>\n<li>Proven experience in managing SEO for global clients.</li>\n<li>Strong knowledge of keyword research, on-page and off-page optimization, and link-building strategies.</li>\n<li>Demonstrated ability to drive organic growth and improve keyword rankings.</li>\n<li>Proficiency in SEO tools such as Google Analytics, SEMrush, Ahrefs, Moz, etc.</li>\n<li>Updated with latest SEO methods and strategies</li>\n<li>Excellent analytical skills and attention to detail.</li>\n<li>Strong communication skills to collaborate effectively with team members and clients.</li>\n<li>Ability to stay organized and manage multiple projects simultaneously.</li>\n</ul>",
      "status": 1,
      "created_by": 826,
      "created_at": "2024-09-30T19:08:31.000Z",
      "updated_at": null,
      "id": 267,
      "slug": "seO",
      "about_whizlabs": "<p dir=\"ltr\">Whizlabs is a leading online training platform that offers certification courses and practice tests for IT professionals. We're committed to providing high-quality education and helping individuals achieve their career goals.</p>",
      "order_by": 14,
      "expired_at": null
    },
    {
      "position_title": "Cloud Solutions Architect (AWS)",
      "department": 3,
      "job_type": 1,
      "min_exp": "5",
      "max_exp": 10,
      "open_positions": 1,
      "roles_responsibilities": "<ul>\n<li><strong>Design and Implement Cloud Solutions:</strong>\n<ul>\n<li>Develop and implement scalable and robust AWS architecture solutions that meet business and technical requirements.</li>\n<li>Design and deploy applications on AWS, ensuring high availability and fault tolerance.</li>\n</ul>\n</li>\n<li><strong>Performance and Scalability:</strong>\n<ul>\n<li>Evaluate current architectures and propose enhancements to improve performance and scalability.</li>\n<li>Monitor and troubleshoot performance issues, implementing solutions to optimize performance.</li>\n</ul>\n</li>\n<li><strong>Cost Optimization:</strong>\n<ul>\n<li>Analyze and optimize cloud infrastructure to ensure cost efficiency.</li>\n<li>Implement cost-saving strategies, such as right-sizing instances, leveraging reserved instances, and identifying underutilized resources.</li>\n</ul>\n</li>\n<li><strong>Cross-Cloud Knowledge:</strong>\n<ul>\n<li>Utilize knowledge of Azure and Google Cloud to provide comparative insights and potential multi-cloud strategies.</li>\n<li>Stay updated with advancements in AWS, Azure, and Google Cloud services and features.</li>\n</ul>\n</li>\n<li><strong>Collaboration and Communication:</strong>\n<ul>\n<li>Work closely with development, operations, and security teams to ensure cohesive cloud strategies.</li>\n<li>Provide technical guidance and mentorship to team members.</li>\n</ul>\n</li>\n<li><strong>Security and Compliance:</strong>\n<ul>\n<li>Ensure that all cloud solutions comply with security standards and best practices.</li>\n<li>Implement and manage security policies and access controls.</li>\n</ul>\n</li>\n</ul>",
      "minimum_qualifications": "<ul>\n<li>Bachelor&rsquo;s degree in Computer Science, Information Technology, or a related field.</li>\n<li>Minimum of 5 years of experience in cloud architecture, specifically with AWS.</li>\n<li>Proven experience in designing and implementing AWS solutions.</li>\n<li>Knowledge of Azure or Google Cloud is a significant advantage.</li>\n<li>Deep understanding of AWS services (EC2, S3, RDS, Lambda, VPC, CloudFront, etc.).</li>\n<li>AWS Networking and Database management.</li>\n<li>CI/CD Deployments for ECS and Lambda using Code Pipelines. CICD automation.</li>\n<li>Serverless CI/CD Deployment Automation.</li>\n<li>Experience with Linux &amp; Windows Server, DevOps practices and tools (CI/CD pipelines, Jenkins, Ansible, Git).</li>\n<li>Building Strong AWS Security management with IAM, WAF, Inspector etc&hellip;</li>\n<li>Experience with infrastructure as code (IaC) tools such as Terraform, CloudFormation, or similar.</li>\n<li>Proficiency in scripting languages like Python, Shell, or PowerShell.</li>\n<li>Familiarity with containerization technologies (Docker, Kubernetes).</li>\n<li>AWS Certified Solutions Architect (Associate or Professional).</li>\n<li>Knowledge of database management and optimization.</li>\n<li>Familiarity with monitoring tools like CloudWatch, Prometheus, or Grafana.</li>\n</ul>",
      "status": 1,
      "created_by": 826,
      "created_at": "2024-09-30T19:12:00.000Z",
      "updated_at": null,
      "id": 268,
      "slug": "cloudarchitect",
      "about_whizlabs": "<p dir=\"ltr\">Whizlabs is a leading online training platform that offers certification courses and practice tests for IT professionals. We're committed to providing high-quality education and helping individuals achieve their career goals.</p>",
      "order_by": 15,
      "expired_at": null
    },
    {
      "position_title": "Cloud Developer",
      "department": 4,
      "job_type": 1,
      "min_exp": "1",
      "max_exp": 3,
      "open_positions": 1,
      "roles_responsibilities": "<ul>\n<li>Troubleshoot incidents, identify root cause, fix and implement preventive measures</li>\n<li>Cloud Technical document creation.</li>\n<li>Employ exceptional problem-solving skills, with the ability to see and solve issues before they affect business productivity.</li>\n<li>Participate in all aspects of the software development life cycle for AWS solutions, including planning, requirements, development, testing, and quality assurance.</li>\n</ul>",
      "minimum_qualifications": "<ul>\n<li>Cloud Knowledge - Intermediate Level - AWS/Azure/GCP</li>\n<li>Hands on experience on Cloud Environment</li>\n<li>Analytical Skills - Experience in understanding the cloud Issues and fixing</li>\n<li>Python Knowledge, Boto3 - Intermediate</li>\n<li>Terraform Knowledge - Intermediate</li>\n<li>Certification - Value Addition</li>\n<li>English Writing Skills</li>\n</ul>",
      "status": 1,
      "created_by": 1689512,
      "created_at": "2022-05-10T11:53:42.000Z",
      "updated_at": "2023-03-27T03:30:50.000Z",
      "id": 34,
      "slug": "cloud-developer",
      "about_whizlabs": "<p>Founded in 2000 by serial entrepreneurs who hailed from IIT Delhi. We are India&rsquo;s one of the leading certification training providers, also awarded the ' Most Innovative Indian IT Company&rsquo; award by NASSCOM in 2004 . We are one of the first in the industry to launch online training for various technologies.</p>\n<p>Based in Bangalore, Coimbatore and New Delhi (India), we have helped over 5 Million professionals and companies across 150+ countries to get trained, pass certifications, and helped them to succeed in their careers.</p>",
      "order_by": 7,
      "expired_at": null
    },
    {
      "position_title": "Cloud Internship",
      "department": 5,
      "job_type": 1,
      "min_exp": "Fresher",
      "max_exp": null,
      "open_positions": 5,
      "roles_responsibilities": "<p dir=\"ltr\">We are seeking a highly motivated and detail-oriented individual to join our team as a Cloud Intern. As a Cloud Intern, you will work closely with our Cloud team to learn and gain hands-on experience with cloud technologies, including cloud architecture, cloud migration, and cloud operations.</p>\n<ul>\n<li dir=\"ltr\" role=\"presentation\">Assist with cloud migration and cloud deployment projects</li>\n<li dir=\"ltr\" role=\"presentation\">Learn and utilize cloud technologies such as Amazon Web Services (AWS), Microsoft Azure, or Google Cloud Platform (GCP)</li>\n<li dir=\"ltr\" role=\"presentation\">Work with the Cloud team to design and implement cloud architectures</li>\n<li dir=\"ltr\" role=\"presentation\">Troubleshoot and resolve cloud-related issues</li>\n<li dir=\"ltr\" role=\"presentation\">Assist with automation and scripting tasks related to cloud operations</li>\n<li dir=\"ltr\" role=\"presentation\">Participate in team meetings and provide updates on project progress</li>\n<li dir=\"ltr\" role=\"presentation\">Continuously learn and stay up to date with the latest cloud technologies and best practices</li>\n<li dir=\"ltr\" role=\"presentation\">Assist with other tasks as needed</li>\n</ul>",
      "minimum_qualifications": "<ul>\n<li dir=\"ltr\" role=\"presentation\">Pursuing a degree in Computer Science, Information Technology, or related field</li>\n<li dir=\"ltr\" role=\"presentation\">Understanding of cloud computing concepts and technologies</li>\n<li dir=\"ltr\" role=\"presentation\">Familiarity with cloud platforms such as AWS, Azure, or GCP</li>\n<li dir=\"ltr\" role=\"presentation\">Understanding of networking and security concepts</li>\n<li dir=\"ltr\" role=\"presentation\">Strong problem-solving and analytical skills</li>\n<li dir=\"ltr\" role=\"presentation\">Excellent communication and collaboration skills</li>\n<li dir=\"ltr\" role=\"presentation\">Ability to work independently as well as part of a team</li>\n<li dir=\"ltr\" role=\"presentation\">Familiarity with cloud migration and deployment processes</li>\n<li dir=\"ltr\" role=\"presentation\">Experience with scripting languages such as Python or PowerShell</li>\n<li dir=\"ltr\" role=\"presentation\">Understanding of Agile development methodologies such as Scrum</li>\n<li dir=\"ltr\" role=\"presentation\">Familiarity with containerization technologies such as Docker or Kubernetes&nbsp;</li>\n</ul>\n<p>If you are passionate about cloud computing and want to gain hands-on experience in a dynamic and fast-paced environment, we encourage you to apply for this exciting opportunity</p>",
      "status": 1,
      "created_by": 4,
      "created_at": "2023-03-20T05:55:42.000Z",
      "updated_at": "2023-03-20T09:08:59.000Z",
      "id": 135,
      "slug": "cloud-intern",
      "about_whizlabs": "<p>Founded in 2000 by serial entrepreneurs who hailed from IIT Delhi. We are India&rsquo;s one of the leading certification training providers, also awarded the ' Most Innovative Indian IT Company&rsquo; award by NASSCOM in 2004 . We are one of the first in the industry to launch online training for various technologies.</p>\n<p>Based in Bangalore, Coimbatore and New Delhi (India), we have helped over 10 Million professionals and companies across 150+ countries to get trained, pass certifications, and helped them to succeed in their careers.</p>",
      "order_by": 4,
      "expired_at": null
    }
  ]
}